Revit 2027 API
KeyBasedTreeEntries.GetKeyBasedTreeEntriesIterator Method
 Returns a KeyBasedTreeEntriesIterator that iterates through the collection.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public KeyBasedTreeEntriesIterator GetKeyBasedTreeEntriesIterator()
Public Function GetKeyBasedTreeEntriesIterator As KeyBasedTreeEntriesIterator
public:
KeyBasedTreeEntriesIterator^ GetKeyBasedTreeEntriesIterator()
member GetKeyBasedTreeEntriesIterator : unit -> KeyBasedTreeEntriesIterator
Return Value
KeyBasedTreeEntriesIterator
 A KeyBasedTreeEntriesIterator object that can be used to iterate through KeyBasedTreeEntry objects in the collection.
See Also
Reference
KeyBasedTreeEntries Class
Autodesk.Revit.DB Namespace